<?php

return [
    'date_range' => 'Диапазон дат',
    'clear' => 'Сбросить',
    'department_of_the_author' => 'Отдел автора',
    'choose_department' => 'Выбрать отдел',
    'author' => 'Автор',
    'choose_author' => 'Выбрать автора',
    'executor' => 'Исполнитель',
    'choose_executor' => 'Выбрать исполнителя',
    'age_of_ideas' => 'Возраст идей',
    'choose_age_of_ideas' => 'Выбрать возраст идей',
    'idea_ages' => [
        'Добавленные >45 дней назад',
        'Добавленные >90 дней назад',
        ],
    'department' => 'Отдел',
    'core_competency' => 'Основная компетенция',
    'operational_goal' => 'Операционная цель',
    'type' => 'Тип',
    'tag' => 'Тэг',
    'search' => 'Поиск',
    'total' => 'Всего',
    'total_completed' => 'Всего реализовано',
    'total_for_90_days' => 'Всего за 90 дней',
    'completed_for_90_days' => 'Реализованные за 90 дней',
    'new_first' => 'Сначала новые',
    'old_first' => 'Сначала старые',
    'pending' => 'На рассмотрении',
    'read_more' => 'Подробнее',
    'idea_implementation_date' => 'Дата реализации идеи',
    'implemented_in_days' => 'Реализовано за дней',
    'previous' => 'Назад',
    'next' => 'Далее',
    'nothing_found' => 'Ничего не найдено',
    'list_menu' => [
        'Идеи',
        'Приоритетный список',
        'Мои идеи',
        'Ожидающие',
        'Отклоненные',
    ],
    'add_comment' => 'Добавить комментарий',
    'comments' => 'Комментариев',
    'headline' => 'Заголовок',
    'create_headline' => 'Придумайте заголовок, например купить новый диван для кухни',
    'description' => 'Описание',
    'estimated_time' => 'Время реализации идеи',
    'estimated_example' => 'Например: 3 месяца',
    'estimated_description' => 'Необходимое для реализации идеи время',
    'choose' => 'Выберите',
    'available_tags' => 'Доступные тэги',
    'added_tags' => 'Добавленные тэги',
    'enter_new_tag' => 'Введите новый тэг либо выберите из списка',
    'new_idea' => 'Новая идея',
    'save' => 'Сохранить',
    'idea_successfully_added' => 'Спасибо. Ваша идея успешно добавлена.',
    'published_after_approval' => 'Идея будет опубликована только после одобрения администратором.',
    'accept' => 'Принять',
    'reject' => 'Отклонить',
    'reason_for_rejection' => 'Укажите причину отклонения',
    'rejected_for_a_reason' => 'Отклонена по причине',
    'rejected' => 'Отклонено',
    'rejection_reason' => 'Причина отказа',
    'executors' => 'Исполнители',
    'choose_executors' => 'Выберите исполнителей',
    'assign_executors' => 'Назначить исполнителей',
    'likes' => 'Лайки',
    'commentaries' => 'Комментарии',
    'likes_comments' => 'Лайки + Комментарии',
    'like' => 'Поддерживают',
    'i_don\'t_like' => 'Я не поддерживаю',
    'i_like' => 'Я поддерживаю',
    'created' => 'Создана',
    'implemented' => 'Реализована',
    'reject_idea' => 'Отклонить идею',
    'explanatory_note' => 'Пояснительная записка',
    'change_note' => 'Изменить записку',
    'not_priority' => 'Не приоритетное',
    'pin_as_priority' => 'Закрепить как приоритетное',
    'list_of_users' => 'Список пользователей',
    'users' => 'Пользователей',
    'access_denied' => 'Доступ запрещен',
    'page_not_found' => 'Страницы не существует',
    'profile' => 'Профиль',
    'name' => 'Имя',
    'surname' => 'Фамилия',
    'email' => 'Email',
    'new_password' => 'Новый пароль',
    'password_confirmation' => 'Подтверждение пароля',
    'change_password' => 'Изменить пароль',
    'change_status' => 'Изменить статус',
    'enter_details' => 'Укажите подробности',
    'edit' => 'Редактировать',
    'edit_idea' => 'Редактировать идею',
    'change' => 'Изменить',
    'is_active' => 'Активно',
    'remove' => 'Удалить',
    'actions' => 'Действия',
    'add' => 'Добавить',
    'categories' => 'Категории',
    'statuses' => 'Статусы',
    'departments' => 'Отделы',
    'positions' => 'Должности',
    'core_competencies' => 'Основные компетенции',
    'operational_goals' => 'Операционные цели',
    'strategic_objectives' => 'Стратегические задачи',
    'types' => 'Типы',
    'rejected_idea' => 'Отклонена',
    'not_yet_approved' => 'Еще не одобрена',
    'approved' => 'Одобрена',
    'details' => 'Подробности',
    'about_system' => 'О системе',
    'ideas' => 'Идеи',
    'priority_list' => 'Приоритетный список',
    'my_ideas' => 'Мои идеи',
    'awaiting' => 'Ожидающие',
    'rejected_menu' => 'Отклоненные',
    'users_menu' => 'Пользователи',
    'add_idea' => 'Добавить идею',
    'active_ideas' => 'Активных идей',
    'on_pause' => 'На паузе',
    'completed_ideas' => 'Завершенных идей',
    'role' => 'Роль',
    'create_status' => 'Создать статус',
    'edit_status' => 'Редактировать статус',
    'create_department' => 'Создать отдел',
    'edit_department' => 'Редактировать отдел',
    'create_position' => 'Создать должность',
    'edit_position' => 'Редактировать должность',
    'create_core_competency' => 'Создать основную компетенцию',
    'edit_core_competency' => 'Редактировать основную компетенцию',
    'create_operational_goal' => 'Создать операционную цель',
    'edit_operational_goal' => 'Редактировать операционную цель',
    'create_strategic_objective' => 'Создать стратегическую задачу',
    'edit_strategic_objective' => 'Редактировать стратегическую задачу',
    'create_type' => 'Создать тип',
    'edit_type' => 'Редактировать тип',
    'unable_delete_standard_status' => 'Это стандартный статус. Его нельзя удалить.',
    'unable_delete_ideas_with_status' => 'Невозможно удалить статус. Существуют идеи с таким статусом.',
    'unable_delete_ideas_with_department' => 'Невозможно удалить элемент. Существуют идеи с таким отделом.',
    'unable_delete_users_with_department' => 'Невозможно удалить элемент. Существуют пользователи с таким отделом.',
    'unable_delete_users_with_position' => 'Невозможно удалить элемент. Существуют пользователи с такой должностью.',
    'unable_delete_ideas_with_competence' => 'Невозможно удалить элемент. Существуют идеи с такой компетенцией.',
    'unable_delete_ideas_with_purpose' => 'Невозможно удалить элемент. Существуют идеи с такой целью.',
    'unable_delete_ideas_with_task' => 'Невозможно удалить элемент. Существуют идеи с такой задачей.',
    'unable_delete_ideas_with_type' => 'Невозможно удалить элемент. Существуют идеи с таким типом.',

    'about_title' => 'Система улучшений и инноваций (PIS) в «Икантэм»',
    'about_text' => '
        <b>Генерация идей, категоризация, приоритизация и реализация – это цели системы PIS.</b>
        <br><br>
        - Идеи проходят модерацию до того, как будут опубликованы в системе. Когда идея опубликована –
        автору
        приходит подтверждение об активации на почту. Помимо этого автор получают уведомления на ящик,
        если
        идею не приняли к публикации (с указанием причины) и если сменили ее статус.<br><br>
        - У идей 3 статуса – «активная» (можно сказать, находится на рассмотрении), «на паузе» (идеи,
        которые могут
        быть внесены в план реализации в недалеком будущем, а пока работа над их возможной реализацией
        приостановлена) и «реализована» (идея была воплощена в жизнь).<br><br>
        - Форма добавления идеи (<a href=":route_add_idea">:route_add_idea</a>) имеет определенные поля для
        классификации, что
        позволяет делать более четкую обработку предложений:<br><br>
        <ul class="without-list-style">
            <li>
                <b>Основная компетенция</b> – список компетенций компании в выпадающем списке. К
                разработке мы
                также относим дизайн, а к продажам – маркетинг. Соответственно относим идею к
                релевантной
                компетенции или выбираем «другая»
            </li>
            <li>
                <b>Операционная цель</b> – это текущие операционные цели компании. Их можно также
                посмотреть в Вики
                -> Видение и цели -> Операционные цели
            </li>
            <li>
                <b>Стратегическая задача</b> – это текущие стратегические задачи «Икантэм». Их можно
                также
                посмотреть в Вики -> Видение и цели -> Стратегические задачи
            </li>
            <li><b>Отдел</b> – к какому отделу относится идея</li>
            <li><b>Тип</b> – суть предложения затрагивает деятельность компании в целом или отдельного
                отдела?
            </li>
        </ul>
        <br>
        Можно сделать выбор нескольких компетенций, целей, задач или отделов (используя CTRL).
        Не стоит беспокоиться по поводу правильного выбора вышеперечисленных полей, так как идея будет
        проходить модерацию и при необходимости категории будут подправлены.
        <hr>
        Важные идеи для реализации операционных целей и стратегических задач попадают в <strong>Priority Boards</strong>
        (задача
        отбора возложена на менеджеров и начальников отделов) и сопровождаются пояснительной
        запиской.<br>
        Пояснительная записка - это анализ влияния идеи на заинтересованные стороны (клиенты,
        сотрудники,
        партнеры, собственники – на кого повлияет и какой ожидаем результат), ценность идеи (ROI),
        соответствие
        долгосрочным целям компании.
    ',
    'send_invite' => '
        Вы получили это письмо, потому что Вас пригласили принять участие в жизни компании Ikantam.
        Для завершения регистрации перейдите по
        <a href=":route_invite">ссылке</a>.
        Или скопируйте ссылку :route_invite и вставте в адресную строку браузера.
    ',
    'reset_pass' => '
        Для завершения процедуры восстановления пароля перейдите по
        <a href=":route_password_reset">ссылке</a>.
    ',
    'like_to_user' => 'Пользователю :likeAuthorFullName понравилась идея',
    'proposal_implementation_detached' => 'От вас откреплена реализация предложения',
    'watch_whole' => 'Смотреть целиком',
    'proposal_implementation_assigned' => 'За вами закреплена реализация предложения',
    'idea_declined_to_user' => 'Ваша идея :ideaTitle была отклонена по причине',
    'your_idea_successfully_added' => 'Спасибо. Ваша идея успешно добавлена. В ближайшее время она будет промодерирована.',
    'new_idea_added' => 'Добавлена новая идея',
    'view' => 'Просмотреть',
    'moderated_soon' => 'Скоро ее промодерируют.',
    'idea_changed_status_to_user' => 'Для идеи :ideaTitle был изменен статус',
    'idea_implemented' => 'Реализована очередная идея',
    'idea_approved_to_user' => 'Ваша идея :ideaTitle опубликована.',
    'new_idea_published' => 'Опубликована новая идея.',
    'new_comment' => 'Добавил(а) новый комментарий к',
    'send_anonymously' => 'Отправить анонимно',
    'anonymous' => 'Анонимные',
    'anonym' => 'Аноним',
    'add_similar_ideas' => 'Добавить похожие идеи',
    'similar_ideas' => 'Похожие идеи',
    'added_similar_ideas' => 'Добавленные похожие идеи',
    'similar_ideas_id_incorrect' => 'Передан не верный набор похожих идей',
    'resolution' => 'Решение',
];
